// Вывести квадрат числа



Console.WriteLine("Введите число");
int number = Convert.ToInt16(Console.ReadLine());
Console.WriteLine("{0} в квадрате = {1}", number, Math.Pow(number, 2)); 