//Даны два числа. Показать большее и меньшее число
int a =2;
int b =4;
if (a > b) 
{
    Console.Write("Большее число = ");
    Console.WriteLine(a);
    Console.Write("Меньшее число = ");
    Console.Write(b);
}
else
{
    Console.Write("Большее число = ");
    Console.WriteLine(b);
    Console.Write("Меньшее число = ");
    Console.Write(a);
}